src/Catalogs/СценарииАвтоматизации/СценарииАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СценарииАвтоматизации</name>
  <attributes>
    <name>РежимВыполнения</name>
    <comment>Предполагает возможность выполнения на одном Агенте нескольких сценариев одновременно</comment>
    <type>
      <types>EnumRef.РежимВыполненияСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставляется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШагиАвтоматизации</name>
    <attributes>
      <name>НомерШага</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШагРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторШага</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторШагаРодителя</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипШага</name>
      <type>
        <types>EnumRef.ТипыЭлементовСхемыСценария</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.КомандыАвтоматизации</types>
      </type>
    </attributes>
    <attributes>
      <name>КомандаОтката</name>
      <type>
        <types>CatalogRef.КомандыАвтоматизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЕдиницыОборудования</name>
      <type>
        <types>CatalogRef.ШаблоныЕдиницАвтоматизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаШага</name>
      <comment>Если шаг нужно начать не ранее определенного времени после завершения предыдущего</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВключенПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключенПоУмолчаниюОткат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыШаговАвтоматизации</name>
    <attributes>
      <name>УникальныйИдентификаторШага</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДляОтката</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтурыАдминистрирования</name>
    <comment>Используется для ограничения доступа к данным. Если не выбрано, доступно всем</comment>
    <attributes>
      <name>Контур</name>
      <type>
        <types>CatalogRef.КонтурыАдминистрирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныЗаполненияПараметров</name>
    <attributes>
      <name>ИмяШаблона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполнения</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПараметровКоманды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтносительнаяСсылкаНаМетаданные</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетВИнтерфейсныхГруппировках</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>String</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетаданныеСвязанныхОбъектов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СценарииАвтоматизации/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Поставляется = Ложь;
	КонецЕсли;
	
	ПустыеЗначения = ПараметрыШаговАвтоматизации.НайтиСтроки(Новый Структура("Значение", ""));
	Для Каждого Элемент Из ПустыеЗначения Цикл
		ПараметрыШаговАвтоматизации.Удалить(Элемент);
	КонецЦикла;
	
	ПустыеНазванияШагов = ШагиАвтоматизации.НайтиСтроки(Новый Структура("Название", ""));
	Для Каждого Элемент Из ПустыеНазванияШагов Цикл
		Элемент.Название = ?(ЗначениеЗаполнено(Элемент.Команда), Элемент.Команда , Элемент.ТипШага);
	КонецЦикла;
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЭкземплярыСценариевАвтоматизации.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.ЭкземплярыСценариевАвтоматизации КАК ЭкземплярыСценариевАвтоматизации
		                      |ГДЕ
		                      |	ЭкземплярыСценариевАвтоматизации.Владелец = &Владелец");
		Запрос.УстановитьПараметр("Владелец", Ссылка);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
#КонецЕсли

#КонецОбласти
